{
  "doc_id": "doc_swaps_pro",
  "original_uuid": "cdf84206-532f-44a8-b985-b74805656e09",
  "content": "# I. Introduction to Jupiter\n\n## What is Jupiter?\n\nJupiter is a trading platform built on the Solana blockchain, designed to provide a seamless swap experience from wallet connection to executing the best-priced trade. It features a powerful aggregation engine that sources liquidity from across the Solana ecosystem. For advanced traders, **Jupiter Pro** offers advanced analytics, industry-leading MEV protection, and significantly lower fees to help discover, analyze, and trade tokens at high speed.\n\n## Connecting Your Wallet\n\nTo begin trading on any of Jupiter's products (**Swap**, **Recurring**, or **Trigger**), you must first connect a wallet.\n\n1.  Navigate to the relevant page on `jup.ag` (e.g., `jup.ag/swap`, `jup.ag/recurring`).\n2.  Click the **“Connect Wallet”** button.\n3.  Choose your connection method:\n    *   **Quick Account:** An embedded wallet that allows for instant, signless transactions. You can create this wallet via social and web3 logins. It is non-custodial and secured by Privy.\n    *   **Classic Mode:** Connect your preferred Solana ecosystem wallet, such as Jupiter Mobile, Phantom, Solflare, or any other supported wallet.\n4.  Approve the connection request from within your wallet application.\n\n# II. Instant Swaps: Executing Immediate Trades\n\n## Overview of Swapping on Jupiter\n\nTrading tokens on Jupiter is designed to be simple and efficient. The platform provides a seamless experience, abstracting away technical complexities while ensuring users get the best possible price for their trades.\n\n## Step-by-Step: Swapping Tokens\n\n### Choosing Your Swap Mode: Ultra vs. Manual\n\nJupiter offers two primary modes for executing swaps:\n\n*   **Ultra Mode:** This mode is designed to \"just work.\" It abstracts away all technical configurations by using Real-Time Slippage Estimation (RTSE) and dynamic priority fees for optimized transaction landing. It is the recommended mode for most users. A 0.1% swap fee is applied on volatile pairs, though swaps between SOL/Stables, JUP/Stables/SOL, JLP/Stables/SOL, and jupSOL/Stables/SOL are free.\n*   **Manual Mode:** For users who desire granular control, this mode allows you to pick your own settings for slippage, fees, and more. It charges 0% fee to Jupiter.\n\n### Understanding Swap Details (Price Impact, Route, Network Fee)\n\nWhen preparing a swap, Jupiter displays several key details:\n\n*   **Price Impact:** This is influenced by the available liquidity and the size of your trade. A large trade in a pool with low liquidity will result in a higher price impact.\n*   **Route Details:** This acts as Jupiter's GPS for your tokens. By clicking on the market or route information (e.g., \"1 Market\" or \"2 Routes + 2 Markets\"), you can see the exact path your swap will take through various liquidity pools to achieve the quoted price.\n*   **Network Fee:** This is the amount paid to the Solana network to process your transaction. If you are using **Manual Mode** with certain settings, this may also include **Jito Tips**, which is a cost for interacting with Solana via Jito validators.\n\n## Advanced Swap Settings (Manual Mode)\n\nBy switching to **Manual Mode**, you can customize the following settings:\n\n### Slippage Configuration\n\n*   **Dynamic Slippage:** Automatically adapts to the token and current market conditions.\n*   **Fixed Slippage:** Set a specific percentage threshold (e.g., 0.5%, 1%) to control the maximum price deviation you are willing to accept.\n\n### Transaction Broadcasting Options (Priority Fee, Jito Only, Both)\n\n*   **Priority Fee:** Uses a typical RPC and adds a priority fee to help your transaction get included in a block faster.\n*   **Jito Only:** Sends your transaction directly to a Jito RPC with a Jito tip for MEV-protected transactions.\n*   **Both:** Sends your transaction via both methods simultaneously. If the transaction is processed through a typical RPC, only the Priority Fee is paid. If it is processed through Jito validators, both the Priority Fee and Jito tip are paid.\n\n### Transaction Speed Settings (Fast, Turbo, Ultra)\n\nAdjust the priority fee based on urgency:\n*   **Fast:** Lower fees for standard priority.\n*   **Turbo:** Moderate fees for higher priority.\n*   **Ultra:** Higher fees for maximum speed and priority.\n\n### Fee Modes (Max Cap, Exact Fee)\n\n*   **Max Cap:** A dynamically estimated maximum fee based on your trade size.\n*   **Exact Fee:** Specify an exact fee amount for your transaction.\n\n### AMM Exclusion\n\nThis setting allows you to turn specific Automated Market Makers (AMMs) on or off, excluding them from being used in your swap route.\n\n## Understanding Wrapped SOL (wSOL)\n\n### What is wSOL and Why is it Needed?\n\n**Wrapped SOL (wSOL)** is native SOL that is wrapped using the Solana Token Program, which allows it to be treated like any other SPL token. Jupiter typically has to wrap SOL before a trade and unwrap it after, because native SOL is not an SPL token. This wrapping/unwrapping process adds an extra instruction to the transaction. For power traders who transact frequently with SOL, using wSOL directly makes trading faster and more convenient.\n\n### How to Enable wSOL Settings\n\nYou can enable direct trading with wSOL in **Manual settings** by turning on the **Use wSOL** toggle. Once enabled, a wSOL toolbar will appear on the swap form, helping you track the amount of SOL vs. wSOL in your wallet. When this setting is on, all transactions will use wSOL. Note that any wSOL you receive will not be automatically unwrapped into native SOL.\n\n### Wrapping and Unwrapping SOL\n\nOn the wSOL toolbar, click the **Manage** button. A modal will appear that allows you to wrap your native SOL into wSOL or unwrap your wSOL back into native SOL.\n\n# III. Automated Trading: Recurring Orders (DCA)\n\n## Understanding How Recurring Orders Work (In-Depth)\n\n**Recurring** orders, also known as Dollar-Cost Averaging (DCA), allow you to set up a machine that processes your trades at specified intervals.\n\n### Creation Process of Recurring Orders\n\n1.  When you initiate a **Recurring** order, the input tokens (e.g., USDC) are transferred from your wallet into a special vault (a program-owned associated token account).\n2.  Your first order is processed immediately upon creating the position. For example, if you set up a plan to swap $1,000 USDC into SOL over 10 days, the full $1,000 USDC is moved to the vault, and the first trade of $100 USDC for SOL happens right away.\n3.  The remaining trades execute at regular intervals according to your chosen schedule. To make your strategy less predictable and more secure, each trade executes within a randomized window of ±30 seconds from the scheduled time.\n\n### The Order Execution Mechanism\n\nYour total order is split into smaller, individual trades. For example, a plan to swap $900 USDC into SOL over 3 days will be split into three trades of $300 USDC each.\n\n*   **Day 1:** The first $300 USDC -> SOL trade happens immediately upon confirmation.\n*   **Day 2:** Roughly 24 hours later, the second trade executes.\n*   **Day 3:** The final trade completes the plan.\n\nThe amount of the output token you receive depends on its market price at the time of each trade.\n\n### Token Transfers After Each Order\n\nEach time a recurring order executes, the purchased tokens are automatically sent to your wallet within the same transaction. This automatic transfer requires that you have the correct **Associated Token Account (ATA)** for the purchased token. Jupiter **Recurring** creates this ATA for you when you set up your plan.\n\n**Warning:** If you manually close the ATA for the purchased token (e.g., through your wallet or a third-party tool), future auto-transfers will fail. Instead, the purchased tokens will remain in your **Recurring** vault and will only be transferred as a lump sum at the end of the entire plan. You can also manually withdraw tokens from the vault at any time via the UI.\n\n### Auto-Closing Your Recurring Orders\n\nAt the end of your recurring cycle, the program automatically handles the closure.\n*   If your wallet's ATA for the output token remains open, tokens are transferred with each order.\n*   If you closed the ATA mid-cycle, the program uses a portion of the rent from your order account to re-open the token account and transfer the accumulated tokens to you.\n*   By default, 2/3 of the rent from your **Recurring** account is sent back to you. The remaining 1/3 is recoverable if you later close the ATA that holds your tokens.\n\n## Setting Up Your First Recurring Order\n\n### Choosing Tokens and Setting Plan Details\n\n1.  Connect your wallet on the **Jupiter Recurring page**.\n2.  Select the token you want to sell and the token you want to buy.\n3.  Enter the amount you want to invest per transaction (e.g., $10 worth of SOL).\n4.  Choose the frequency of your purchases (minute, hour, day, week, or month).\n5.  Enter the total number of orders for the plan.\n6.  Optionally, you can set a minimum and maximum price range, and orders will only execute if the market price is within that range.\n\n### Reviewing Your Plan and Approving Transactions\n\n1.  Before confirming, carefully review the summary, which details the tokens, amounts, frequency, and total investment.\n2.  If everything is correct, click **“Place Recurring Order”**.\n3.  Your wallet will prompt you to approve the initial transaction to set up the plan. Once approved, Jupiter will handle all future transactions automatically.\n\n## Managing Your Recurring Plans\n\n### Viewing Active and Past Orders\n\nOn the **Recurring** dashboard, you can view all your plans.\n*   The **“Active Orders”** tab lists all ongoing plans.\n*   The **“Past Orders”** tab lists all completed or canceled plans, showing the total amount invested, average purchase price, and duration.\n\n### Understanding Plan Details (Overview, Balance, Summary)\n\nBy expanding an active order, you can view detailed information:\n*   **Balance Summary:** Shows the remaining balance of your input token and the total amount of the output token that has been successfully purchased and withdrawn.\n*   **Order Summary:** Displays key details like total deposited, total spent, order size, current average price, purchase interval, number of orders left, and the next order's scheduled time.\n\n### Closing and Withdrawing Funds\n\nAt the bottom of an active order's details, there is a **“Close and Withdraw”** button. Clicking this will cancel the recurring order, halt any future trades, and withdraw all remaining funds from the vault back to your wallet.\n\n### Pro Tips for Managing Multiple Orders\n\n1.  **Diversify:** Use **Recurring** to build positions in tokens with different risk profiles.\n2.  **Monitor Funds:** Ensure your wallet has sufficient funds for all active plans.\n3.  **Analyze Trends:** Use the dashboard insights to adjust your strategies.\n4.  **Stay Organized:** Regularly check the \"My Plans\" section to stay on top of your investments.\n\n## Recurring Order FAQs\n\n### Can I Modify or Pause My Recurring Plan?\n\nNo. Once a **Recurring** plan is set up, it cannot be modified or paused. To make changes, you must cancel the existing plan and create a new one with your updated preferences.\n\n### Do Recurring Plans Automatically Retry on Failure?\n\nYes. If a recurring purchase fails due to network issues, insufficient slippage, or other reasons, the program will automatically retry the order. This ensures minimal disruption to your strategy.\n\n### Does Jupiter Recurring Charge Fees?\n\nYes, Jupiter **Recurring** charges a platform fee of **0.1%** on order completion.\n\n### How is the Price Calculated for Each Recurring Purchase?\n\nThe price for each purchase is calculated based on the current market price at the moment the transaction is executed. Jupiter includes slippage protection to ensure you receive a minimum amount of tokens. If the price moves beyond the acceptable slippage threshold, the transaction will fail to protect your funds.\n\n# IV. Advanced Trading: Trigger Orders (Limit Orders)\n\n## Understanding How Trigger Orders Work\n\nJupiter **Trigger** orders execute your trade based on a price you set, matching it with available on-chain liquidity across Solana. It is not a traditional order book system.\n\n### Order Creation and Keeper Mechanism\n\nWhen you place a **Trigger** order, the tokens you are selling are transferred to keeper bots. These keepers continuously monitor token prices on-chain via the Jupiter Price API. When the market price reaches your specified trigger price, the keepers are programmed to execute the order. You can set up multiple trigger orders using the same token, provided you have a sufficient balance.\n\n### Token Acquisition and Order Closure\n\nWhen the market price hits your trigger price, your order becomes eligible for execution. The keeper bot will execute the order, and the purchased tokens are automatically transferred to your wallet. If the order is large and liquidity is insufficient, the keeper may execute it in smaller chunks to avoid significant price impact, ensuring partial fulfillment at the best possible price until the order is completely filled.\n\n### Trigger Orders vs. Central Limit Order Book (CLOB)\n\nUnlike a CLOB, which matches buy and sell orders in a central book, Jupiter **Trigger** orders execute based on aggregated on-chain liquidity from over 20 DEXs and AMMs. This means a **Trigger** order may not always get filled even if the target price is briefly touched (a \"wick\"), as there might not be sufficient available liquidity for the keeper to execute against at that moment.\n\n### Using Slippage with Trigger Orders (Ultra Mode)\n\nBy default, **Trigger** orders aim for **zero** slippage, meaning keepers will only try to execute when the price is met precisely. This can lead to aggressive retries in volatile markets. To improve the success rate, especially for volatile tokens, you can use **Ultra Mode** for **Trigger** orders, which allows you to opt-in to a fixed slippage amount to increase the likelihood of execution.\n\n## Creating Trigger Orders\n\n### Setting Your Order Mode: Ultra vs. Exact\n\n*   **Ultra Mode:** Increases the chance of execution during volatile periods by intelligently applying minimal slippage. This is great for volatile tokens or when you prioritize a successful fill over receiving the exact amount.\n*   **Exact Mode:** Executes with 0% slippage. You get exactly the amount you set (minus fees).\n\n### Defining Your Rate and Expiry\n\n1.  Enter the amount of the token you are selling.\n2.  Enter the rate at which you want to buy your selected token. This is the trigger price.\n3.  Optionally, set an expiry for your order (e.g., 10 minutes, 1 day, or never). If the order is not executed by the expiry time, it will be automatically canceled.\n\n### Reviewing and Placing Your Trigger Order\n\nBefore placing the order, double-check all details in the summary. Click **“Place Trigger Order”** and approve the transaction in your wallet.\n\n## Managing Your Trigger Orders\n\n### Viewing Open and Past Orders\n\nOn the **Trigger** dashboard, you can see your **“Open Orders”** (submitted but not yet executed) and **“Past Orders”** (completed or canceled).\n\n### Understanding Order Details (Target Price, Total Filled)\n\nFor each open order, you can see:\n*   The tokens being sold and bought.\n*   **Target Price:** The price at which the order will execute.\n*   **Total Filled:** The percentage of the order that has been executed. This is useful for large orders that may be filled partially over time.\n*   **Expiry:** The time remaining until the order expires.\n\n### Cancelling Individual or All Orders\n\nYou have the option to cancel a single order using the **“Cancel Order”** button or cancel all of your open orders at once with the **“Cancel All”** button. When an order is canceled, the funds are refunded to your wallet.\n\n## Trigger Order FAQs\n\n### Why Didn't My Trigger Order Work? (Keeper Updates, Liquidity)\n\nJupiter **Trigger** is not an order-book system. It relies on a keeper to monitor on-chain prices and available liquidity. During highly volatile periods, the price and liquidity can change between the moment the price is hit and when the keeper attempts execution. The challenge is less about the keeper's refresh speed and more about the availability of on-chain liquidity at the exact trigger price.\n\n### Why is My Trigger Order Not Being Filled?\n\nAn order may not be filled for several reasons:\n*   **Insufficient Liquidity:** If your order size is too large for the available on-chain liquidity, the keeper will attempt to fill it in smaller chunks.\n*   **Price Wicks:** The price may have touched your target for only a very short period, and the liquidity at that price was taken up before your order could be executed.\n\n### Failed Transactions and Fees in Wallet History\n\nYou may see failed transactions in your wallet history associated with a **Trigger** order. The transaction fees for these failed attempts, which are initiated and signed by the keeper bot, are **paid by the keeper**, not by you.\n\n# V. Trading Safely on Jupiter\n\n## Navigating Risks in DeFi Trading\n\nDeFi trading can be complex due to the variety of tokens and their different risk profiles. Jupiter is committed to balancing convenience with user protection by providing safety notifications, warnings, and key token information.\n\n## Safety Notifications and Warnings\n\n### Price Impact and Rate Discrepancy Alerts\n\n*   **Price Impact Alert:** This warning is triggered based on available liquidity and your trade size. A large trade in an illiquid pool can cause huge price impact. You can mitigate this by breaking your trade into smaller sizes, for instance with **Recurring** orders.\n*   **Rate Discrepancy Alert:** Jupiter shows the quoted rate versus a market rate. A large difference can be due to factors like price impact, token taxes, or a stale market price. Trade with caution if you see a large discrepancy.\n\n## Key Token Information\n\n### Token Verification Status\n\nJupiter displays a token's verification status as either **\"Verified ✅\"** or **\"Not Verified ⚠️\"**. This is based on a new class of metrics that gauges how organic a token is by measuring activity among real people, including buying, holding, and selling volume. This is not a guarantee against scams but an indicator of organic interest.\n\n### Understanding Token2022 Extensions (Permanent Delegate, Transfer Tax, Freeze Authority)\n\nJupiter displays information pills for Token2022 extensions, which can carry risks:\n\n| Extension            | Definition                                                                                             | Valid Use                                                        | Misuse                                                                                          |\n| -------------------- | ------------------------------------------------------------------------------------------------------ | ---------------------------------------------------------------- | ----------------------------------------------------------------------------------------------- |\n| **Permanent Delegate** | Allows creators to grant unlimited delegation privileges, including burning or transferring tokens.   | Enables automatic payments, wallet recovery, or processing refunds. | Scam projects could drain tokens from user wallets.                                             |\n| **Transfer Tax**     | Enables fees to be withheld on each transfer, redeemable by a withdraw authority.                      | Allows projects to generate revenue or collect royalties.        | Scam projects might arbitrarily increase taxes and withdraw funds.                              |\n| **Freeze Authority** | Allows issuers to halt token transfers or trading, temporarily or permanently.                           | Used for regulated tokens (e.g., stablecoins) for compliance.    | Scammers may use this to prevent trading, a red flag for market manipulation or potential fraud. |\n\n## MEV Protection (Maximal Extractable Value)\n\n### How Jupiter Protects Your Orders (Randomized Timing, Price Checks, Auto-Cancel)\n\nJupiter has built-in protections to reduce the risk of MEV and front-running:\n*   **MEV Protect Mode:** When enabled, this sends your transactions directly to Jito block engines, minimizing the risk of sandwich attacks.\n*   **Randomized Timing:** For **Recurring** orders, execution has a randomized window (±30 seconds), making it difficult for bots to predict and exploit your trade.\n*   **Price Check Before Execution:** Jupiter checks real-time prices before executing a swap.\n*   **Auto-Cancel for Bad Prices:** If a trade would result in you receiving less than your minimum expected amount (based on your slippage setting), it automatically fails to protect you.\n\n### Considerations for Jito Only Modes\n\nIf you are using **MEV Protect** or **Jito Only** modes, be aware that your transactions may at times fail or be slow to process, as not all Solana validators use the Jito block engine.\n\n## Understanding the Swap Summary\n\nThe swap summary shows crucial information related to your trade, including the minimum amount you will receive, the transaction fees, and any price difference when compared to the market rate.\n\n## ExactOut Functionality\n\n**ExactOut** is a feature that allows you to specify the exact amount of tokens you wish to receive. Jupiter will calculate the required input amount. An alert is shown when using this feature because liquidity venues and routes are more limited than for standard (ExactIn) swaps, which may result in a worse price. It is best practice to compare the rates between **ExactOut** and ExactIn before you trade.\n\n# VI. Jupiter PRO: Tools for Advanced Traders\n\n## What is Jupiter Pro? (Benefits and Features)\n\n**Jupiter Pro** is designed for advanced traders to discover, analyze, and trade tokens at high speed. It brings together advanced analytics, industry-leading MEV protection, and fees that are 10x lower than other platforms.\n\nKey features include:\n*   Adding tokens to a personal watchlist.\n*   Using **Quick Buy** to instantly trade with a default currency (USDC/SOL).\n*   Discovering tokens with filters and real-time analytics.\n*   Utilizing metrics like Net Buy Volume, Net Buyers, and Smart Likes.\n*   Protection from sandwich attacks via **Ultra Mode's** MEV protection.\n*   Paying significantly lower trading fees.\n\n## Using AlphaScan on Jupiter Pro\n\n### Discovering New, Soon, and Bonded Tokens\n\nThe **AlphaScan** feed helps you discover and trade new token launches. It is a pro terminal that fetches launchpad token data beyond the typical 24-hour window. You'll see tokens categorized as:\n1.  **New**: Newly created tokens with at least one liquidity pool.\n2.  **Soon**: Tokens with bonding curve progress above 50%.\n3.  **Bonded**: Tokens that have successfully migrated their liquidity to an AMM.\n\n### Filtering and Quick Buy Options\n\nYou can filter the **AlphaScan** feed by launchpads, market cap, net buy volume, and more. You can trade any token directly from the feed using the **Quick Buy ⚡️** button.\n\n## Checking Token Safety on Jupiter Pro\n\n**Jupiter Pro** provides several indicators to help you gauge token safety. However, always conduct your own research.\n\n### Developer Controls (Mint/Freeze Authority)\n\n*   **Mint Authority:** Indicates if the developer can create new tokens.\n*   **Freeze Authority:** Shows if the developer can freeze token accounts.\n\n### Token Distribution Analysis\n\n*   Total number of holders.\n*   Bonding Curve Percentage.\n*   **Dev Bought and Sold (DB/DS):** Indicated on the token chart.\n*   **Top 10 Holders:** A checkmark ✅ appears if the top 10 holders own less than 15% of the supply.\n\n### Community Metrics (Organic Score, CT Likes)\n\n*   **🌱 Organic Score:** Measures the organic interest in a token.\n*   **👍 CT Likes:** Brings community validation from X (formerly Twitter), allowing users to \"like\" tokens or flag potential honeypots or scams.\n\n# VII. Common Issues and Troubleshooting\n\n## Why Do My Swaps Keep Failing?\n\nWhen buying a new token with high volatility, it can be difficult to land a trade. This is often due to rapid price movement causing the trade to fail because of built-in slippage protection. It should typically take no more than 3 tries to buy a highly volatile token. You will pay the gas fee for failed trades.\n\n## Why Did I receive Fewer Tokens Than Expected?\n\nPossible reasons include:\n1.  **Slippage:** The price of the token moved between the time you submitted the swap and when it was executed.\n2.  **Routing Optimization:** Your swap may have been split across multiple liquidity pools.\n3.  **Liquidity Depth:** A token with low liquidity will experience significant price impact from a trade.\n\nAlways check the preview screen before confirming a swap to see the estimated final amount.\n\n## Why is My Transaction Taking Longer Than Expected?\n\nSeveral factors can delay transaction execution:\n*   **Network Congestion:** The Solana network may be experiencing high activity.\n*   **Low Liquidity:** If your trade needs to be routed through multiple pools, it may take longer.\n*   **Slippage Settings Too Low:** If the price moves beyond your set slippage tolerance, the trade may get stuck or fail.\n\n## Accidentally Bought the Wrong Tokens - What Can I Do?\n\nTokens on Solana are permissionless, meaning anyone can create a token. Always verify you are buying the right token by checking the contract address. While Jupiter attempts to filter out fake tokens and ranks search results by activity, the platform is likely unable to provide support or compensation for buying the wrong token.\n\n## I Got Rekt, I Want a Refund! (Ultra Mode Policy)\n\nIf you believe you suffered a loss due to a platform issue while using **Ultra Mode**, you may be eligible for compensation under specific circumstances:\n*   A bad quote caused by bad routing, especially when a better route was available.\n*   More than 3 consecutive trades failed to execute, leading to a loss in gas fees.\n*   Unreasonably high slippage (>20%) when unnecessary, leading to a sandwich attack.\n\n**Please note:**\n*   Compensation is only for **Ultra Mode** users.\n*   Potential profit and loss (P&L) is never compensated.\n*   Jupiter cannot guarantee zero MEV; **Ultra Mode** minimizes the risk but does not eliminate it.\n*   Allow up to 3 days for refund requests to be processed.\n\n## Will My Order Get Frontrun?\n\nJupiter has built-in protections to make front-running risky and unprofitable for bots. These include randomized execution timing for **Recurring** orders, real-time price checks before execution, and auto-cancellation if the price moves against you beyond your slippage tolerance. Using **MEV Protect** mode further reduces risk by sending transactions directly to Jito block engines.\n\n## Exporting Transaction History for Tax or Other Purposes\n\nYou can export your **Recurring** and **Trigger** order history by using a block explorer like Solscan. Navigate to your wallet address on Solscan, go to the \"Transfers\" tab, and use the export CSV option to download your transaction data.\n\n## Understanding Failed Transactions in Your Wallet History\n\nThird-party wallets like Phantom and Solflare may not accurately display what is happening with Jupiter transactions. For a clearer view, use Jupiter's built-in history/activity page or a block explorer like Solscan for a deeper dive. For **Trigger** orders specifically, failed transactions signed by the keeper are paid for by the keeper, not you.\n\n# VIII. Understanding Jupiter's Core Technology & Fees\n\n## All About Jupiter's Aggregation Engine: Juno\n\n### Juno: A Self-Learning, Self-Improving Aggregator\n\n**Juno** is Jupiter's next-generation, self-learning aggregator, the most powerful routing system designed in DeFi. It builds upon previous versions and, for the first time, includes third-party aggregators in its routing mix. Using real-time analysis, **Juno** learns and improves with every transaction. When it detects inaccuracies or other issues that degrade the user experience, it learns and proactively prevents them from reoccurring.\n\n### Components of Juno (Metis, Metis V1.5, JupiterZ, Third-Party Aggregators)\n\n**Juno** combines several powerful components to find the best price:\n1.  **Metis:** Jupiter's original v1 on-chain engine that powers swaps in the API and for partners like Phantom and Solflare.\n2.  **Metis V1.5:** A new router that solves complex swaps with new hops and splits, improving the quoted-to-executed price by an average of 4.6x.\n3.  **JupiterZ:** An RFQ (Request for Quote) product that works with market makers to tap into new liquidity sources.\n4.  **Third-Party Aggregators:** Integration of external aggregators like Hashflow and Dflow.\n\n### History of Jupiter's Routing Engine\n\nJupiter's routing engine has evolved with the Solana ecosystem. It automatically lists new tokens from major AMMs like Raydium, Meteora, and Pump.fun for 15 days. After that, markets are checked every 30 minutes for liquidity requirements to remain part of the router.\n\n### Metis: The OG On-Chain Engine\n\n**Metis** is Jupiter's original routing algorithm, a heavily modified variant of the Bellman-Ford algorithm. It was designed to execute trades quickly, discover the best routes for all pairs to reduce slippage, and offer high-quality price routing at scale. **Metis** streams input tokens to iteratively build routes that can split and merge at any stage, allowing it to find better prices for complex trades. On average, **Metis** quotes prices 5.22% better than the previous version (V2).\n\n## What Do I Pay to Trade on Jupiter? (Fee Breakdown)\n\nWhen you trade on Jupiter, there are several potential fees:\n*   **Solana Network Fees:** The cost of interacting with the Solana network. This fee is paid to Solana validators regardless of whether your trade succeeds or fails. **Ultra Mode** dynamically adjusts this fee to maximize your chances of success.\n*   **Jito Tip:** A fee paid to Jito if you are using MEV-protect or **Jito Only** mode for your transaction.\n*   **Jupiter Commission:** A fee paid to Jupiter. This is typically charged on **Jupiter Perps**, when using **Ultra Mode** for swaps (0.1% on volatile pairs), or when **Recurring** and **Trigger** orders are filled. Manual Swaps are free of Jupiter commission.\n\n## How Secure is Ultra Swap?\n\n**Ultra Swap** is built on the robust Solana blockchain, and its smart contracts undergo regular audits and security checks. While no system is completely risk-free, Jupiter follows best practices to ensure secure transactions. Users should always be vigilant, look out for safety notifications and warnings provided in the UI, verify transaction details, and use secure wallets.",
  "chunks": [
    {
      "chunk_id": "doc_swaps_pro_chunk_0",
      "original_index": 0,
      "content": "# I. Introduction to Jupiter\n\n## What is Jupiter?\n\nJupiter is a trading platform built on the Solana blockchain, designed to provide a seamless swap experience from wallet connection to executing the best-priced trade. It features a powerful aggregation engine that sources liquidity from across the Solana ecosystem. For advanced traders, **Jupiter Pro** offers advanced analytics, industry-leading MEV protection, and significantly lower fees to help discover, analyze, and trade tokens at high speed.\n\n## Connecting Your Wallet\n\nTo begin trading on any of Jupiter's products (**Swap**, **Recurring**, or **Trigger**), you must first connect a wallet.\n\n1.  Navigate to the relevant page on `jup.ag` (e.g., `jup.ag/swap`, `jup.ag/recurring`).\n2.  Click the **“Connect Wallet”** button.\n3.  Choose your connection method:\n    *   **Quick Account:** An embedded wallet that allows for instant, signless transactions. You can create this wallet via social and web3 logins. It is non-custodial and secured by Privy.\n    *   **Classic Mode:** Connect your preferred Solana ecosystem wallet, such as Jupiter Mobile, Phantom, Solflare, or any other supported wallet.\n4.  Approve the connection request from within your wallet application."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_1",
      "original_index": 1,
      "content": "# II. Instant Swaps: Executing Immediate Trades\n\n## Overview of Swapping on Jupiter\n\nTrading tokens on Jupiter is designed to be simple and efficient. The platform provides a seamless experience, abstracting away technical complexities while ensuring users get the best possible price for their trades.\n\n## Step-by-Step: Swapping Tokens\n\n### Choosing Your Swap Mode: Ultra vs. Manual\n\nJupiter offers two primary modes for executing swaps:\n\n*   **Ultra Mode:** This mode is designed to \"just work.\" It abstracts away all technical configurations by using Real-Time Slippage Estimation (RTSE) and dynamic priority fees for optimized transaction landing. It is the recommended mode for most users. A 0.1% swap fee is applied on volatile pairs, though swaps between SOL/Stables, JUP/Stables/SOL, JLP/Stables/SOL, and jupSOL/Stables/SOL are free.\n*   **Manual Mode:** For users who desire granular control, this mode allows you to pick your own settings for slippage, fees, and more. It charges 0% fee to Jupiter.\n\n### Understanding Swap Details (Price Impact, Route, Network Fee)\n\nWhen preparing a swap, Jupiter displays several key details:\n\n*   **Price Impact:** This is influenced by the available liquidity and the size of your trade. A large trade in a pool with low liquidity will result in a higher price impact.\n*   **Route Details:** This acts as Jupiter's GPS for your tokens. By clicking on the market or route information (e.g., \"1 Market\" or \"2 Routes + 2 Markets\"), you can see the exact path your swap will take through various liquidity pools to achieve the quoted price.\n*   **Network Fee:** This is the amount paid to the Solana network to process your transaction. If you are using **Manual Mode** with certain settings, this may also include **Jito Tips**, which is a cost for interacting with Solana via Jito validators.\n\n## Advanced Swap Settings (Manual Mode)\n\nBy switching to **Manual Mode**, you can customize the following settings:\n\n### Slippage Configuration\n\n*   **Dynamic Slippage:** Automatically adapts to the token and current market conditions.\n*   **Fixed Slippage:** Set a specific percentage threshold (e.g., 0.5%, 1%) to control the maximum price deviation you are willing to accept.\n\n### Transaction Broadcasting Options (Priority Fee, Jito Only, Both)\n\n*   **Priority Fee:** Uses a typical RPC and adds a priority fee to help your transaction get included in a block faster.\n*   **Jito Only:** Sends your transaction directly to a Jito RPC with a Jito tip for MEV-protected transactions.\n*   **Both:** Sends your transaction via both methods simultaneously. If the transaction is processed through a typical RPC, only the Priority Fee is paid. If it is processed through Jito validators, both the Priority Fee and Jito tip are paid.\n\n### Transaction Speed Settings (Fast, Turbo, Ultra)\n\nAdjust the priority fee based on urgency:\n*   **Fast:** Lower fees for standard priority.\n*   **Turbo:** Moderate fees for higher priority.\n*   **Ultra:** Higher fees for maximum speed and priority.\n\n### Fee Modes (Max Cap, Exact Fee)\n\n*   **Max Cap:** A dynamically estimated maximum fee based on your trade size.\n*   **Exact Fee:** Specify an exact fee amount for your transaction.\n\n### AMM Exclusion\n\nThis setting allows you to turn specific Automated Market Makers (AMMs) on or off, excluding them from being used in your swap route.\n\n## Understanding Wrapped SOL (wSOL)\n\n### What is wSOL and Why is it Needed?\n\n**Wrapped SOL (wSOL)** is native SOL that is wrapped using the Solana Token Program, which allows it to be treated like any other SPL token. Jupiter typically has to wrap SOL before a trade and unwrap it after, because native SOL is not an SPL token. This wrapping/unwrapping process adds an extra instruction to the transaction. For power traders who transact frequently with SOL, using wSOL directly makes trading faster and more convenient.\n\n### How to Enable wSOL Settings\n\nYou can enable direct trading with wSOL in **Manual settings** by turning on the **Use wSOL** toggle. Once enabled, a wSOL toolbar will appear on the swap form, helping you track the amount of SOL vs. wSOL in your wallet. When this setting is on, all transactions will use wSOL. Note that any wSOL you receive will not be automatically unwrapped into native SOL.\n\n### Wrapping and Unwrapping SOL\n\nOn the wSOL toolbar, click the **Manage** button. A modal will appear that allows you to wrap your native SOL into wSOL or unwrap your wSOL back into native SOL."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_2",
      "original_index": 2,
      "content": "# III. Automated Trading: Recurring Orders (DCA)\n\n## Understanding How Recurring Orders Work (In-Depth)\n\n**Recurring** orders, also known as Dollar-Cost Averaging (DCA), allow you to set up a machine that processes your trades at specified intervals.\n\n### Creation Process of Recurring Orders\n\n1.  When you initiate a **Recurring** order, the input tokens (e.g., USDC) are transferred from your wallet into a special vault (a program-owned associated token account).\n2.  Your first order is processed immediately upon creating the position. For example, if you set up a plan to swap $1,000 USDC into SOL over 10 days, the full $1,000 USDC is moved to the vault, and the first trade of $100 USDC for SOL happens right away.\n3.  The remaining trades execute at regular intervals according to your chosen schedule. To make your strategy less predictable and more secure, each trade executes within a randomized window of ±30 seconds from the scheduled time.\n\n### The Order Execution Mechanism\n\nYour total order is split into smaller, individual trades. For example, a plan to swap $900 USDC into SOL over 3 days will be split into three trades of $300 USDC each.\n\n*   **Day 1:** The first $300 USDC -> SOL trade happens immediately upon confirmation.\n*   **Day 2:** Roughly 24 hours later, the second trade executes.\n*   **Day 3:** The final trade completes the plan.\n\nThe amount of the output token you receive depends on its market price at the time of each trade.\n\n### Token Transfers After Each Order\n\nEach time a recurring order executes, the purchased tokens are automatically sent to your wallet within the same transaction. This automatic transfer requires that you have the correct **Associated Token Account (ATA)** for the purchased token. Jupiter **Recurring** creates this ATA for you when you set up your plan.\n\n**Warning:** If you manually close the ATA for the purchased token (e.g., through your wallet or a third-party tool), future auto-transfers will fail. Instead, the purchased tokens will remain in your **Recurring** vault and will only be transferred as a lump sum at the end of the entire plan. You can also manually withdraw tokens from the vault at any time via the UI.\n\n### Auto-Closing Your Recurring Orders\n\nAt the end of your recurring cycle, the program automatically handles the closure.\n*   If your wallet's ATA for the output token remains open, tokens are transferred with each order.\n*   If you closed the ATA mid-cycle, the program uses a portion of the rent from your order account to re-open the token account and transfer the accumulated tokens to you.\n*   By default, 2/3 of the rent from your **Recurring** account is sent back to you. The remaining 1/3 is recoverable if you later close the ATA that holds your tokens.\n\n## Setting Up Your First Recurring Order\n\n### Choosing Tokens and Setting Plan Details\n\n1.  Connect your wallet on the **Jupiter Recurring page**.\n2.  Select the token you want to sell and the token you want to buy.\n3.  Enter the amount you want to invest per transaction (e.g., $10 worth of SOL).\n4.  Choose the frequency of your purchases (minute, hour, day, week, or month).\n5.  Enter the total number of orders for the plan.\n6.  Optionally, you can set a minimum and maximum price range, and orders will only execute if the market price is within that range.\n\n### Reviewing Your Plan and Approving Transactions\n\n1.  Before confirming, carefully review the summary, which details the tokens, amounts, frequency, and total investment.\n2.  If everything is correct, click **“Place Recurring Order”**.\n3.  Your wallet will prompt you to approve the initial transaction to set up the plan. Once approved, Jupiter will handle all future transactions automatically.\n\n## Managing Your Recurring Plans\n\n### Viewing Active and Past Orders\n\nOn the **Recurring** dashboard, you can view all your plans.\n*   The **“Active Orders”** tab lists all ongoing plans.\n*   The **“Past Orders”** tab lists all completed or canceled plans, showing the total amount invested, average purchase price, and duration.\n\n### Understanding Plan Details (Overview, Balance, Summary)\n\nBy expanding an active order, you can view detailed information:\n*   **Balance Summary:** Shows the remaining balance of your input token and the total amount of the output token that has been successfully purchased and withdrawn.\n*   **Order Summary:** Displays key details like total deposited, total spent, order size, current average price, purchase interval, number of orders left, and the next order's scheduled time.\n\n### Closing and Withdrawing Funds\n\nAt the bottom of an active order's details, there is a **“Close and Withdraw”** button. Clicking this will cancel the recurring order, halt any future trades, and withdraw all remaining funds from the vault back to your wallet.\n\n### Pro Tips for Managing Multiple Orders\n\n1.  **Diversify:** Use **Recurring** to build positions in tokens with different risk profiles.\n2.  **Monitor Funds:** Ensure your wallet has sufficient funds for all active plans.\n3.  **Analyze Trends:** Use the dashboard insights to adjust your strategies.\n4.  **Stay Organized:** Regularly check the \"My Plans\" section to stay on top of your investments.\n\n## Recurring Order FAQs\n\n### Can I Modify or Pause My Recurring Plan?\n\nNo. Once a **Recurring** plan is set up, it cannot be modified or paused. To make changes, you must cancel the existing plan and create a new one with your updated preferences.\n\n### Do Recurring Plans Automatically Retry on Failure?\n\nYes. If a recurring purchase fails due to network issues, insufficient slippage, or other reasons, the program will automatically retry the order. This ensures minimal disruption to your strategy.\n\n### Does Jupiter Recurring Charge Fees?\n\nYes, Jupiter **Recurring** charges a platform fee of **0.1%** on order completion.\n\n### How is the Price Calculated for Each Recurring Purchase?\n\nThe price for each purchase is calculated based on the current market price at the moment the transaction is executed. Jupiter includes slippage protection to ensure you receive a minimum amount of tokens. If the price moves beyond the acceptable slippage threshold, the transaction will fail to protect your funds."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_3",
      "original_index": 3,
      "content": "# IV. Advanced Trading: Trigger Orders (Limit Orders)\n\n## Understanding How Trigger Orders Work\n\nJupiter **Trigger** orders execute your trade based on a price you set, matching it with available on-chain liquidity across Solana. It is not a traditional order book system.\n\n### Order Creation and Keeper Mechanism\n\nWhen you place a **Trigger** order, the tokens you are selling are transferred to keeper bots. These keepers continuously monitor token prices on-chain via the Jupiter Price API. When the market price reaches your specified trigger price, the keepers are programmed to execute the order. You can set up multiple trigger orders using the same token, provided you have a sufficient balance.\n\n### Token Acquisition and Order Closure\n\nWhen the market price hits your trigger price, your order becomes eligible for execution. The keeper bot will execute the order, and the purchased tokens are automatically transferred to your wallet. If the order is large and liquidity is insufficient, the keeper may execute it in smaller chunks to avoid significant price impact, ensuring partial fulfillment at the best possible price until the order is completely filled.\n\n### Trigger Orders vs. Central Limit Order Book (CLOB)\n\nUnlike a CLOB, which matches buy and sell orders in a central book, Jupiter **Trigger** orders execute based on aggregated on-chain liquidity from over 20 DEXs and AMMs. This means a **Trigger** order may not always get filled even if the target price is briefly touched (a \"wick\"), as there might not be sufficient available liquidity for the keeper to execute against at that moment.\n\n### Using Slippage with Trigger Orders (Ultra Mode)\n\nBy default, **Trigger** orders aim for **zero** slippage, meaning keepers will only try to execute when the price is met precisely. This can lead to aggressive retries in volatile markets. To improve the success rate, especially for volatile tokens, you can use **Ultra Mode** for **Trigger** orders, which allows you to opt-in to a fixed slippage amount to increase the likelihood of execution.\n\n## Creating Trigger Orders\n\n### Setting Your Order Mode: Ultra vs. Exact\n\n*   **Ultra Mode:** Increases the chance of execution during volatile periods by intelligently applying minimal slippage. This is great for volatile tokens or when you prioritize a successful fill over receiving the exact amount.\n*   **Exact Mode:** Executes with 0% slippage. You get exactly the amount you set (minus fees).\n\n### Defining Your Rate and Expiry\n\n1.  Enter the amount of the token you are selling.\n2.  Enter the rate at which you want to buy your selected token. This is the trigger price.\n3.  Optionally, set an expiry for your order (e.g., 10 minutes, 1 day, or never). If the order is not executed by the expiry time, it will be automatically canceled.\n\n### Reviewing and Placing Your Trigger Order\n\nBefore placing the order, double-check all details in the summary. Click **“Place Trigger Order”** and approve the transaction in your wallet.\n\n## Managing Your Trigger Orders\n\n### Viewing Open and Past Orders\n\nOn the **Trigger** dashboard, you can see your **“Open Orders”** (submitted but not yet executed) and **“Past Orders”** (completed or canceled).\n\n### Understanding Order Details (Target Price, Total Filled)\n\nFor each open order, you can see:\n*   The tokens being sold and bought.\n*   **Target Price:** The price at which the order will execute.\n*   **Total Filled:** The percentage of the order that has been executed. This is useful for large orders that may be filled partially over time.\n*   **Expiry:** The time remaining until the order expires.\n\n### Cancelling Individual or All Orders\n\nYou have the option to cancel a single order using the **“Cancel Order”** button or cancel all of your open orders at once with the **“Cancel All”** button. When an order is canceled, the funds are refunded to your wallet.\n\n## Trigger Order FAQs\n\n### Why Didn't My Trigger Order Work? (Keeper Updates, Liquidity)\n\nJupiter **Trigger** is not an order-book system. It relies on a keeper to monitor on-chain prices and available liquidity. During highly volatile periods, the price and liquidity can change between the moment the price is hit and when the keeper attempts execution. The challenge is less about the keeper's refresh speed and more about the availability of on-chain liquidity at the exact trigger price.\n\n### Why is My Trigger Order Not Being Filled?\n\nAn order may not be filled for several reasons:\n*   **Insufficient Liquidity:** If your order size is too large for the available on-chain liquidity, the keeper will attempt to fill it in smaller chunks.\n*   **Price Wicks:** The price may have touched your target for only a very short period, and the liquidity at that price was taken up before your order could be executed.\n\n### Failed Transactions and Fees in Wallet History\n\nYou may see failed transactions in your wallet history associated with a **Trigger** order. The transaction fees for these failed attempts, which are initiated and signed by the keeper bot, are **paid by the keeper**, not by you."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_4",
      "original_index": 4,
      "content": "# V. Trading Safely on Jupiter\n\n## Navigating Risks in DeFi Trading\n\nDeFi trading can be complex due to the variety of tokens and their different risk profiles. Jupiter is committed to balancing convenience with user protection by providing safety notifications, warnings, and key token information.\n\n## Safety Notifications and Warnings\n\n### Price Impact and Rate Discrepancy Alerts\n\n*   **Price Impact Alert:** This warning is triggered based on available liquidity and your trade size. A large trade in an illiquid pool can cause huge price impact. You can mitigate this by breaking your trade into smaller sizes, for instance with **Recurring** orders.\n*   **Rate Discrepancy Alert:** Jupiter shows the quoted rate versus a market rate. A large difference can be due to factors like price impact, token taxes, or a stale market price. Trade with caution if you see a large discrepancy.\n\n## Key Token Information\n\n### Token Verification Status\n\nJupiter displays a token's verification status as either **\"Verified ✅\"** or **\"Not Verified ⚠️\"**. This is based on a new class of metrics that gauges how organic a token is by measuring activity among real people, including buying, holding, and selling volume. This is not a guarantee against scams but an indicator of organic interest.\n\n### Understanding Token2022 Extensions (Permanent Delegate, Transfer Tax, Freeze Authority)\n\nJupiter displays information pills for Token2022 extensions, which can carry risks:\n\n| Extension            | Definition                                                                                             | Valid Use                                                        | Misuse                                                                                          |\n| -------------------- | ------------------------------------------------------------------------------------------------------ | ---------------------------------------------------------------- | ----------------------------------------------------------------------------------------------- |\n| **Permanent Delegate** | Allows creators to grant unlimited delegation privileges, including burning or transferring tokens.   | Enables automatic payments, wallet recovery, or processing refunds. | Scam projects could drain tokens from user wallets.                                             |\n| **Transfer Tax**     | Enables fees to be withheld on each transfer, redeemable by a withdraw authority.                      | Allows projects to generate revenue or collect royalties.        | Scam projects might arbitrarily increase taxes and withdraw funds.                              |\n| **Freeze Authority** | Allows issuers to halt token transfers or trading, temporarily or permanently.                           | Used for regulated tokens (e.g., stablecoins) for compliance.    | Scammers may use this to prevent trading, a red flag for market manipulation or potential fraud. |\n\n## MEV Protection (Maximal Extractable Value)\n\n### How Jupiter Protects Your Orders (Randomized Timing, Price Checks, Auto-Cancel)\n\nJupiter has built-in protections to reduce the risk of MEV and front-running:\n*   **MEV Protect Mode:** When enabled, this sends your transactions directly to Jito block engines, minimizing the risk of sandwich attacks.\n*   **Randomized Timing:** For **Recurring** orders, execution has a randomized window (±30 seconds), making it difficult for bots to predict and exploit your trade.\n*   **Price Check Before Execution:** Jupiter checks real-time prices before executing a swap.\n*   **Auto-Cancel for Bad Prices:** If a trade would result in you receiving less than your minimum expected amount (based on your slippage setting), it automatically fails to protect you.\n\n### Considerations for Jito Only Modes\n\nIf you are using **MEV Protect** or **Jito Only** modes, be aware that your transactions may at times fail or be slow to process, as not all Solana validators use the Jito block engine.\n\n## Understanding the Swap Summary\n\nThe swap summary shows crucial information related to your trade, including the minimum amount you will receive, the transaction fees, and any price difference when compared to the market rate.\n\n## ExactOut Functionality\n\n**ExactOut** is a feature that allows you to specify the exact amount of tokens you wish to receive. Jupiter will calculate the required input amount. An alert is shown when using this feature because liquidity venues and routes are more limited than for standard (ExactIn) swaps, which may result in a worse price. It is best practice to compare the rates between **ExactOut** and ExactIn before you trade."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_5",
      "original_index": 5,
      "content": "# VI. Jupiter PRO: Tools for Advanced Traders\n\n## What is Jupiter Pro? (Benefits and Features)\n\n**Jupiter Pro** is designed for advanced traders to discover, analyze, and trade tokens at high speed. It brings together advanced analytics, industry-leading MEV protection, and fees that are 10x lower than other platforms.\n\nKey features include:\n*   Adding tokens to a personal watchlist.\n*   Using **Quick Buy** to instantly trade with a default currency (USDC/SOL).\n*   Discovering tokens with filters and real-time analytics.\n*   Utilizing metrics like Net Buy Volume, Net Buyers, and Smart Likes.\n*   Protection from sandwich attacks via **Ultra Mode's** MEV protection.\n*   Paying significantly lower trading fees.\n\n## Using AlphaScan on Jupiter Pro\n\n### Discovering New, Soon, and Bonded Tokens\n\nThe **AlphaScan** feed helps you discover and trade new token launches. It is a pro terminal that fetches launchpad token data beyond the typical 24-hour window. You'll see tokens categorized as:\n1.  **New**: Newly created tokens with at least one liquidity pool.\n2.  **Soon**: Tokens with bonding curve progress above 50%.\n3.  **Bonded**: Tokens that have successfully migrated their liquidity to an AMM.\n\n### Filtering and Quick Buy Options\n\nYou can filter the **AlphaScan** feed by launchpads, market cap, net buy volume, and more. You can trade any token directly from the feed using the **Quick Buy ⚡️** button.\n\n## Checking Token Safety on Jupiter Pro\n\n**Jupiter Pro** provides several indicators to help you gauge token safety. However, always conduct your own research.\n\n### Developer Controls (Mint/Freeze Authority)\n\n*   **Mint Authority:** Indicates if the developer can create new tokens.\n*   **Freeze Authority:** Shows if the developer can freeze token accounts.\n\n### Token Distribution Analysis\n\n*   Total number of holders.\n*   Bonding Curve Percentage.\n*   **Dev Bought and Sold (DB/DS):** Indicated on the token chart.\n*   **Top 10 Holders:** A checkmark ✅ appears if the top 10 holders own less than 15% of the supply.\n\n### Community Metrics (Organic Score, CT Likes)\n\n*   **🌱 Organic Score:** Measures the organic interest in a token.\n*   **👍 CT Likes:** Brings community validation from X (formerly Twitter), allowing users to \"like\" tokens or flag potential honeypots or scams."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_6",
      "original_index": 6,
      "content": "# VII. Common Issues and Troubleshooting\n\n## Why Do My Swaps Keep Failing?\n\nWhen buying a new token with high volatility, it can be difficult to land a trade. This is often due to rapid price movement causing the trade to fail because of built-in slippage protection. It should typically take no more than 3 tries to buy a highly volatile token. You will pay the gas fee for failed trades.\n\n## Why Did I receive Fewer Tokens Than Expected?\n\nPossible reasons include:\n1.  **Slippage:** The price of the token moved between the time you submitted the swap and when it was executed.\n2.  **Routing Optimization:** Your swap may have been split across multiple liquidity pools.\n3.  **Liquidity Depth:** A token with low liquidity will experience significant price impact from a trade.\n\nAlways check the preview screen before confirming a swap to see the estimated final amount.\n\n## Why is My Transaction Taking Longer Than Expected?\n\nSeveral factors can delay transaction execution:\n*   **Network Congestion:** The Solana network may be experiencing high activity.\n*   **Low Liquidity:** If your trade needs to be routed through multiple pools, it may take longer.\n*   **Slippage Settings Too Low:** If the price moves beyond your set slippage tolerance, the trade may get stuck or fail.\n\n## Accidentally Bought the Wrong Tokens - What Can I Do?\n\nTokens on Solana are permissionless, meaning anyone can create a token. Always verify you are buying the right token by checking the contract address. While Jupiter attempts to filter out fake tokens and ranks search results by activity, the platform is likely unable to provide support or compensation for buying the wrong token.\n\n## I Got Rekt, I Want a Refund! (Ultra Mode Policy)\n\nIf you believe you suffered a loss due to a platform issue while using **Ultra Mode**, you may be eligible for compensation under specific circumstances:\n*   A bad quote caused by bad routing, especially when a better route was available.\n*   More than 3 consecutive trades failed to execute, leading to a loss in gas fees.\n*   Unreasonably high slippage (>20%) when unnecessary, leading to a sandwich attack.\n\n**Please note:**\n*   Compensation is only for **Ultra Mode** users.\n*   Potential profit and loss (P&L) is never compensated.\n*   Jupiter cannot guarantee zero MEV; **Ultra Mode** minimizes the risk but does not eliminate it.\n*   Allow up to 3 days for refund requests to be processed.\n\n## Will My Order Get Frontrun?\n\nJupiter has built-in protections to make front-running risky and unprofitable for bots. These include randomized execution timing for **Recurring** orders, real-time price checks before execution, and auto-cancellation if the price moves against you beyond your slippage tolerance. Using **MEV Protect** mode further reduces risk by sending transactions directly to Jito block engines.\n\n## Exporting Transaction History for Tax or Other Purposes\n\nYou can export your **Recurring** and **Trigger** order history by using a block explorer like Solscan. Navigate to your wallet address on Solscan, go to the \"Transfers\" tab, and use the export CSV option to download your transaction data.\n\n## Understanding Failed Transactions in Your Wallet History\n\nThird-party wallets like Phantom and Solflare may not accurately display what is happening with Jupiter transactions. For a clearer view, use Jupiter's built-in history/activity page or a block explorer like Solscan for a deeper dive. For **Trigger** orders specifically, failed transactions signed by the keeper are paid for by the keeper, not you."
    },
    {
      "chunk_id": "doc_swaps_pro_chunk_7",
      "original_index": 7,
      "content": "# VIII. Understanding Jupiter's Core Technology & Fees\n\n## All About Jupiter's Aggregation Engine: Juno\n\n### Juno: A Self-Learning, Self-Improving Aggregator\n\n**Juno** is Jupiter's next-generation, self-learning aggregator, the most powerful routing system designed in DeFi. It builds upon previous versions and, for the first time, includes third-party aggregators in its routing mix. Using real-time analysis, **Juno** learns and improves with every transaction. When it detects inaccuracies or other issues that degrade the user experience, it learns and proactively prevents them from reoccurring.\n\n### Components of Juno (Metis, Metis V1.5, JupiterZ, Third-Party Aggregators)\n\n**Juno** combines several powerful components to find the best price:\n1.  **Metis:** Jupiter's original v1 on-chain engine that powers swaps in the API and for partners like Phantom and Solflare.\n2.  **Metis V1.5:** A new router that solves complex swaps with new hops and splits, improving the quoted-to-executed price by an average of 4.6x.\n3.  **JupiterZ:** An RFQ (Request for Quote) product that works with market makers to tap into new liquidity sources.\n4.  **Third-Party Aggregators:** Integration of external aggregators like Hashflow and Dflow.\n\n### History of Jupiter's Routing Engine\n\nJupiter's routing engine has evolved with the Solana ecosystem. It automatically lists new tokens from major AMMs like Raydium, Meteora, and Pump.fun for 15 days. After that, markets are checked every 30 minutes for liquidity requirements to remain part of the router.\n\n### Metis: The OG On-Chain Engine\n\n**Metis** is Jupiter's original routing algorithm, a heavily modified variant of the Bellman-Ford algorithm. It was designed to execute trades quickly, discover the best routes for all pairs to reduce slippage, and offer high-quality price routing at scale. **Metis** streams input tokens to iteratively build routes that can split and merge at any stage, allowing it to find better prices for complex trades. On average, **Metis** quotes prices 5.22% better than the previous version (V2).\n\n## What Do I Pay to Trade on Jupiter? (Fee Breakdown)\n\nWhen you trade on Jupiter, there are several potential fees:\n*   **Solana Network Fees:** The cost of interacting with the Solana network. This fee is paid to Solana validators regardless of whether your trade succeeds or fails. **Ultra Mode** dynamically adjusts this fee to maximize your chances of success.\n*   **Jito Tip:** A fee paid to Jito if you are using MEV-protect or **Jito Only** mode for your transaction.\n*   **Jupiter Commission:** A fee paid to Jupiter. This is typically charged on **Jupiter Perps**, when using **Ultra Mode** for swaps (0.1% on volatile pairs), or when **Recurring** and **Trigger** orders are filled. Manual Swaps are free of Jupiter commission.\n\n## How Secure is Ultra Swap?\n\n**Ultra Swap** is built on the robust Solana blockchain, and its smart contracts undergo regular audits and security checks. While no system is completely risk-free, Jupiter follows best practices to ensure secure transactions. Users should always be vigilant, look out for safety notifications and warnings provided in the UI, verify transaction details, and use secure wallets."
    }
  ]
}
